// import {
//   Gost,
// } from './signatures';
// Custom
// 
// const g = new Gost(
//   13499,
// );


// g.sign();
// g.verify();



// ====================




// const g = new Gost(
//   101,
//   4,
//   1,

// );
// const g = new Gost(599);


// const g = new Gost(3499);


// вариант 1 
// m = 10882
// q = 5441,
// const g = new Gost(
//   10711,
//   236,
//   757,
//   // 5441,
// );



// // вариант 2
// // m = 10837
// // q = 10837,
// const g = new Gost(
//   10711,
//   138,
//   757,
// );

// // вариант 3
// // m = 10958
// // q = 5479
// const g = new Gost(
//   11117,
//   338,
//   157,
// );







// проверить на простоту p g
// 
// Проверка подписи: подпись верна.
//
// Использованные параметры: p=10091, m=10190, a=314, b=366, q=5095
// 
// Использованные параметры: p=13999, m=14066, a=591, b=534, q=7033
// Использованные параметры: p=13999, m=13828, a=380, b=455, q=6914
//
// Использованные параметры: p=13499, m=13628, a=554, b=513, q=6814
//