// import { Point } from './lib/classes/point';
// import { getAllFactors, primeFactors } from './lib/utility';
// import {
//   Gost,
// } from './signatures';

// // Custom
// const g = new Gost(
//   13499,
//   446,
//   344,

//   // 1200,
//   // 300,
//   // 30,
//   // 33, 
//   // 90,
//   // 99, 
// );

// // g.M = 'APR';
// // g.M = 'MAY';
// g.M = 'JUN';
// // g.M = 'JUL'; 
// // g.M = 'AUG';

// g.sign();
// g.verify();

// // ====================

// // Использованные параметры: p=13499, m=13450, a=90, b=99, q=269
// // Использованные параметры: p=13499, m=13497, a=71, b=15, q=409
// // ================================
// // Проверка подписи: подпись верна.
// // ================================

// // const g00 = new Gost(
// //   13499,
// //   71,
// //   15,
// // );
// // g00.sign();
// // g00.verify();

// // const g0 = new Gost(
// //   101,
// //   4,ы
// //   1,
// // );
// // g0.sign();
// // g0.verify();

// // const g = new Gost(3499);

// // вариант 1 
// // m = 10882s
// // q = 5441,
// // const g1 = new Gost(
// //   10711,
// //   236,
// //   757,
// //   // 5441,
// // );
// // g1.sign();
// // g1.verify();


// // // вариант 2
// // // m = 10837
// // // q = 10837,
// // const g2 = new Gost(
// //   10711,
// //   138,
// //   757,
// // );
// // g2.sign();
// // g2.verify();

// // // вариант 3
// // // m = 10958
// // // q = 5479

// // const g3 = new Gost(
// //   11117,
// //   338,
// //   157,
// // );
// // g3.sign();
// // g3.verify();



// // проверить на простоту p g
// // 
// // Использованные параметры: p=3539, m=3582, a=104, b=31, q=199
// // 
// // Использованные параметры: p=5101, m=5000, a=87, b=42, q=5
// // 
// // 
// // const f = getAllFactors(6725);
// // const p = primeFactors(6725);

// // console.log(f);
// // console.log(p);


// /**
// 1 + 1 = 2
// 1 + 2 = 3
// 3 + 2 = 5
// 5 + 5 = 10
// 10 + 1 = 11
// 11 + 11 = 22
// 22 + 22 = 44
// 44 + 44 = 88
// 88 + 1 = 89
// 89 + 89 = 178
// 178 + 89 = 267
// 267 + 2 = 269
// 269 + 269 = 538
// 538 + 269 = 807
// 538 + 807 = 1345
// 1345 + 1345 = 2690
// 1345 + 2690 = 4035
// 2690 + 4035 = 6725
//  */
// /**
// 1+1=2
// 2+2=4
// 4+4=8
// 8+8=16
// 16+16=32
// 32+32=64
// 64+64=128
// 128+128=256
// 256+256=512
// 512+512=1024
// 1024+1024=2048
// 2048+2048=4096
// 4096+2048=6144
// 6144+512=6656
// 6656+64=6720
// 6720+5=6725
// */

// // const p1 = new Point(-6749, 413, 1);

// // const p2 = g.addPoints(p1, p1, 2, true); // 2P = (13063, 1545)
// // const p4 = g.addPoints(p2, p2, 4, true); // 4P = (6468, 11783)
// // const p8 = g.addPoints(p4, p4, 8, true); // 8P = (12900, -3150)
// // const p16 = g.addPoints(p8, p8, 16, true); // 16P = (13113, -932)
// // const p32 = g.addPoints(p16, p16, 32, true); // 32P = (9330, -1244)
// // const p64 = g.addPoints(p32, p32, 64, true); //  64P = (7263, -2745)
// // const p128 = g.addPoints(p64, p64, 128, true); // 128P = (13141, -5913)
// // const p256 = g.addPoints(p128, p128, 256, true); //  256P = (3953, 5631)
// // const p512 = g.addPoints(p256, p256, 512, true); //  512P = (13121, 7017)
// // const p1024 = g.addPoints(p512, p512, 1024, true); // 1024P = (10676, 570)
// // const p2048 = g.addPoints(p1024, p1024, 2048, true); // 2048P = (12668, 3753)
// // const p4096 = g.addPoints(p2048, p2048, 4096, true); // 4096P = (701, -2054)
// // const p6144 = g.addPoints(p4096, p2048, 6144, true); // 6144P = (12857, 5343)
// // const p6656 = g.addPoints(p6144, p512, 6656, true); // 6656P = (9518, -4726)
// // const p6720 = g.addPoints(p6656, p64, 6720, true); // 6720P = (7418, -6998)
// // const p6724 = g.addPoints(p6720, p4, 6724, true); // 6724P = (6577, 2571)
// // const p6725 = g.addPoints(p6724, p1, 6725, true); // 6725P = (10926, -4083)

// // 1+1=2
// // 2+2=4
// // 4+4=8
// // 8+8=16
// // 16+16=32
// // 32+32=64
// // 64+64=128
// // 128+128=256
// // 256+256=512
// // 512+512=1024
// // 1024+1024=2048
// // 2048+2048=4096
// // 4096+2048=6144
// // 6144+512=6656
// // 6656+64=6720
// // 6720+5=6725

// // Точка найдена: (-6738, 2122) [5]



// // Складываем точки (-6749, 413) и (-6749, 413).
// // Точка, получившаяся при сложении: 2P = (13063, 1545)
// // 4P = (6540, 3)



// // const p1 = new Point(4, 9, 1);

// // const p2 = g0.addPoints(p1, p1, 2, true); // 2P = (13063, 1545)


